fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>AccumulationRegister.ВКМ_ПремииСотрудникамРег</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудникамиРег</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисленияРег</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_УдержанияРег</registerRecords>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисленияРег/ВКМ_ДополнительныеНачисленияРег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисленияРег</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_УдержанияРег/ВКМ_УдержанияРег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_УдержанияРег</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Начисление</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудникамиРег/ВКМ_ВзаиморасчетыССотрудникамиРег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудникамиРег</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РазмерНДФЛ = Константы.ВКМ_РазмерНДФЛ.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.НомерСтроки КАК НомерСтроки,
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.СуммаПремии КАК Начисление,
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.ВКМ_НачислениеФиксированнойПремии.СписокСотрудников КАК ВКМ_НачислениеФиксированнойПремииСписокСотрудников
		|ГДЕ
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//ДвижениеПремия = Движения.ВКМ_ПремииСотрудникамРег.Добавить();
		ДвижениеПремия = Движения.ВКМ_ДополнительныеНачисленияРег.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеПремия, ВыборкаДетальныеЗаписи);
		ДвижениеПремия.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		ДвижениеПремия.ПериодРегистрации = НачалоМесяца(Дата); 
		ДвижениеПремия.СуммаКОплате = ВыборкаДетальныеЗаписи.Начисление;

		
		ДвижениеУдержания = Движения.ВКМ_УдержанияРег.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеУдержания, ВыборкаДетальныеЗаписи);
		ДвижениеУдержания.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.УдержаниеНДФЛ;
		ДвижениеУдержания.ПериодРегистрации = НачалоМесяца(Дата);
		ДвижениеУдержания.Показатель = РазмерНДФЛ;
		ДвижениеУдержания.Начисление = (ВыборкаДетальныеЗаписи.Начисление * РазмерНДФЛ) / 100; 
		
		
		ДвижениеВзаиморасчетыССотрудниками = Движения.ВКМ_ВзаиморасчетыССотрудникамиРег.Добавить();
		ДвижениеВзаиморасчетыССотрудниками.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВзаиморасчетыССотрудниками.Период = НачалоМесяца(Дата);
		ДвижениеВзаиморасчетыССотрудниками.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		ДвижениеВзаиморасчетыССотрудниками.Сумма = ДвижениеПремия.СуммаКОплате - ДвижениеУдержания.Начисление;
		
		
		
	КонецЦикла;
	
		Движения.ВКМ_ДополнительныеНачисленияРег.Записать();
		Движения.ВКМ_УдержанияРег.Записать();
		Движения.ВКМ_ВзаиморасчетыССотрудникамиРег.Записать();
		
Конецпроцедуры


#КонецОбласти
